##### 读写文本格式的数据
如 csv, html, excel, sql 等格式的数据

In [1]:
!type ..\..\pydata-book\examples\ex1.csv
# !可以调用系统自带的命令，type 就是显示一个文件的内容
# 这里官方的数据库被我拷贝到 \Python for Data Analysis\pydata-book 下

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
import numpy as np
import os
import pandas as pd

实际应用中一般都是从外部导入表格而不是自己创建

In [3]:
path = '..\..\pydata-book\examples'

In [4]:
df = pd.read_csv(os.path.join(path, 'ex1.csv'))
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!type ..\..\pydata-book\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv(os.path.join(path, 'ex2.csv'), header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
df = pd.read_csv(os.path.join(path, 'ex2.csv'), names=['a', 'b', 'c', 'd', 'message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
df.sum()

a                     15
b                     18
c                     21
d                     24
message    helloworldfoo
dtype: object

In [9]:
df.iloc?

In [10]:
df = df.iloc[:3, :4]
# 比如我只想要数据，就用 iloc 索引出来
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [11]:
df.sum(), df.idxmax()

(a    15
 b    18
 c    21
 d    24
 dtype: int64,
 a    2
 b    2
 c    2
 d    2
 dtype: int64)

In [12]:
!type ..\..\pydata-book\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [13]:
res = pd.read_csv(os.path.join(path, 'ex5.csv'))
res

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

##### NaN 是很常见的数据
试想如果有NaN 该怎么求平均，求方差？它又不是一个数

常见的方法，比如:
- 直接将 NaN 赋值为0
- 先求出所有除 NaN 的均值，然后用均值代替 NaN
这样的工作就是清洗数据的一部分

In [14]:
pd.isnull(res)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [15]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
res = pd.read_csv(os.path.join(path, 'ex5.csv'), na_values=sentinels)
# 似乎并未替换
res

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

逐块读取，知道有这个操作即可

In [16]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [17]:
import sys

`sys.stdout` 是标准输出，默认的标准输出是显示屏

In [18]:
df.to_csv(sys.stdout, sep='|')
# seprator 分隔符

|a|b|c|d
0|1|2|3|4
1|5|6|7|8
2|9|10|11|12

In [19]:
df.to_csv(sys.stdout, sep='#')

#a#b#c#d
0#1#2#3#4
1#5#6#7#8
2#9#10#11#12

In [20]:
!type ..\..\pydata-book\examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [21]:
import csv
f = open(os.path.join(path, 'ex7.csv'))
reader = csv.reader(f)

In [22]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [23]:
with open(os.path.join(path, 'ex7.csv')) as f:
    lines = list(csv.reader(f))

In [24]:
header, values = lines[0], lines[1:]

In [25]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON, XML **不用看**

应该不会用到